server/tests/stressPerformanceTests/k6_test_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 150 max VUs, 4m30s max duration (incl. graceful stop):
              * default: Up to 150 looping VUs for 4m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/150 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 001/150 VUs  0m01.0s/4m00.0s

running (0m02.0s), 002/150 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 002/150 VUs  0m02.0s/4m00.0s

running (0m03.0s), 003/150 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 003/150 VUs  0m03.0s/4m00.0s

running (0m04.0s), 004/150 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 004/150 VUs  0m04.0s/4m00.0s

running (0m05.0s), 005/150 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 005/150 VUs  0m05.0s/4m00.0s

running (0m06.0s), 005/150 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 005/150 VUs  0m06.0s/4m00.0s

running (0m07.0s), 006/150 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 006/150 VUs  0m07.0s/4m00.0s

running (0m08.0s), 007/150 VUs, 7 complete and 0 interrupted iterations
default   [   3% ] 007/150 VUs  0m08.0s/4m00.0s

running (0m09.0s), 008/150 VUs, 8 complete and 0 interrupted iterations
default   [   4% ] 008/150 VUs  0m09.0s/4m00.0s

running (0m10.0s), 009/150 VUs, 11 complete and 0 interrupted iterations
default   [   4% ] 009/150 VUs  0m10.0s/4m00.0s

running (0m11.0s), 009/150 VUs, 13 complete and 0 interrupted iterations
default   [   5% ] 009/150 VUs  0m11.0s/4m00.0s

running (0m12.0s), 010/150 VUs, 16 complete and 0 interrupted iterations
default   [   5% ] 010/150 VUs  0m12.0s/4m00.0s

running (0m13.0s), 011/150 VUs, 20 complete and 0 interrupted iterations
default   [   5% ] 011/150 VUs  0m13.0s/4m00.0s

running (0m14.0s), 012/150 VUs, 22 complete and 0 interrupted iterations
default   [   6% ] 012/150 VUs  0m14.0s/4m00.0s

running (0m15.0s), 013/150 VUs, 26 complete and 0 interrupted iterations
default   [   6% ] 013/150 VUs  0m15.0s/4m00.0s

running (0m16.0s), 014/150 VUs, 31 complete and 0 interrupted iterations
default   [   7% ] 014/150 VUs  0m16.0s/4m00.0s

running (0m17.0s), 014/150 VUs, 34 complete and 0 interrupted iterations
default   [   7% ] 014/150 VUs  0m17.0s/4m00.0s

running (0m18.0s), 015/150 VUs, 39 complete and 0 interrupted iterations
default   [   7% ] 015/150 VUs  0m18.0s/4m00.0s

running (0m19.0s), 016/150 VUs, 45 complete and 0 interrupted iterations
default   [   8% ] 016/150 VUs  0m19.0s/4m00.0s

running (0m20.0s), 017/150 VUs, 48 complete and 0 interrupted iterations
default   [   8% ] 017/150 VUs  0m20.0s/4m00.0s

running (0m21.0s), 018/150 VUs, 54 complete and 0 interrupted iterations
default   [   9% ] 018/150 VUs  0m21.0s/4m00.0s

running (0m22.0s), 018/150 VUs, 60 complete and 0 interrupted iterations
default   [   9% ] 018/150 VUs  0m22.0s/4m00.0s

running (0m23.0s), 019/150 VUs, 65 complete and 0 interrupted iterations
default   [  10% ] 019/150 VUs  0m23.0s/4m00.0s

running (0m24.0s), 020/150 VUs, 72 complete and 0 interrupted iterations
default   [  10% ] 020/150 VUs  0m24.0s/4m00.0s

running (0m25.0s), 021/150 VUs, 76 complete and 0 interrupted iterations
default   [  10% ] 021/150 VUs  0m25.0s/4m00.0s

running (0m26.0s), 022/150 VUs, 84 complete and 0 interrupted iterations
default   [  11% ] 022/150 VUs  0m26.0s/4m00.0s

running (0m27.0s), 023/150 VUs, 92 complete and 0 interrupted iterations
default   [  11% ] 023/150 VUs  0m27.0s/4m00.0s

running (0m28.0s), 023/150 VUs, 97 complete and 0 interrupted iterations
default   [  12% ] 023/150 VUs  0m28.0s/4m00.0s

running (0m29.0s), 024/150 VUs, 106 complete and 0 interrupted iterations
default   [  12% ] 024/150 VUs  0m29.0s/4m00.0s

running (0m30.0s), 025/150 VUs, 113 complete and 0 interrupted iterations
default   [  12% ] 025/150 VUs  0m30.0s/4m00.0s

running (0m31.0s), 026/150 VUs, 120 complete and 0 interrupted iterations
default   [  13% ] 026/150 VUs  0m31.0s/4m00.0s

running (0m32.0s), 027/150 VUs, 130 complete and 0 interrupted iterations
default   [  13% ] 027/150 VUs  0m32.0s/4m00.0s

running (0m33.0s), 027/150 VUs, 135 complete and 0 interrupted iterations
default   [  14% ] 027/150 VUs  0m33.0s/4m00.0s

running (0m34.0s), 028/150 VUs, 146 complete and 0 interrupted iterations
default   [  14% ] 028/150 VUs  0m34.0s/4m00.0s

running (0m35.0s), 029/150 VUs, 157 complete and 0 interrupted iterations
default   [  15% ] 029/150 VUs  0m35.0s/4m00.0s

running (0m36.0s), 030/150 VUs, 162 complete and 0 interrupted iterations
default   [  15% ] 030/150 VUs  0m36.0s/4m00.0s

running (0m37.0s), 031/150 VUs, 174 complete and 0 interrupted iterations
default   [  15% ] 031/150 VUs  0m37.0s/4m00.0s

running (0m38.0s), 032/150 VUs, 180 complete and 0 interrupted iterations
default   [  16% ] 032/150 VUs  0m38.0s/4m00.0s

running (0m39.0s), 032/150 VUs, 192 complete and 0 interrupted iterations
default   [  16% ] 032/150 VUs  0m39.0s/4m00.0s

running (0m40.0s), 033/150 VUs, 205 complete and 0 interrupted iterations
default   [  17% ] 033/150 VUs  0m40.0s/4m00.0s

running (0m41.0s), 034/150 VUs, 211 complete and 0 interrupted iterations
default   [  17% ] 034/150 VUs  0m41.0s/4m00.0s

running (0m42.0s), 035/150 VUs, 224 complete and 0 interrupted iterations
default   [  17% ] 035/150 VUs  0m42.0s/4m00.0s

running (0m43.0s), 036/150 VUs, 238 complete and 0 interrupted iterations
default   [  18% ] 036/150 VUs  0m43.0s/4m00.0s

running (0m44.0s), 036/150 VUs, 245 complete and 0 interrupted iterations
default   [  18% ] 036/150 VUs  0m44.0s/4m00.0s

running (0m45.0s), 037/150 VUs, 259 complete and 0 interrupted iterations
default   [  19% ] 037/150 VUs  0m45.0s/4m00.0s

running (0m46.0s), 038/150 VUs, 270 complete and 0 interrupted iterations
default   [  19% ] 038/150 VUs  0m46.0s/4m00.0s

running (0m47.0s), 039/150 VUs, 281 complete and 0 interrupted iterations
default   [  20% ] 039/150 VUs  0m47.0s/4m00.0s

running (0m48.0s), 040/150 VUs, 296 complete and 0 interrupted iterations
default   [  20% ] 040/150 VUs  0m48.0s/4m00.0s

running (0m49.0s), 041/150 VUs, 307 complete and 0 interrupted iterations
default   [  20% ] 041/150 VUs  0m49.0s/4m00.0s

running (0m50.0s), 041/150 VUs, 320 complete and 0 interrupted iterations
default   [  21% ] 041/150 VUs  0m50.0s/4m00.0s

running (0m51.0s), 042/150 VUs, 336 complete and 0 interrupted iterations
default   [  21% ] 042/150 VUs  0m51.0s/4m00.0s

running (0m52.0s), 043/150 VUs, 344 complete and 0 interrupted iterations
default   [  22% ] 043/150 VUs  0m52.0s/4m00.0s

running (0m53.0s), 044/150 VUs, 361 complete and 0 interrupted iterations
default   [  22% ] 044/150 VUs  0m53.0s/4m00.0s

running (0m54.0s), 045/150 VUs, 378 complete and 0 interrupted iterations
default   [  22% ] 045/150 VUs  0m54.0s/4m00.0s

running (0m55.0s), 045/150 VUs, 387 complete and 0 interrupted iterations
default   [  23% ] 045/150 VUs  0m55.0s/4m00.0s

running (0m56.0s), 046/150 VUs, 405 complete and 0 interrupted iterations
default   [  23% ] 046/150 VUs  0m56.0s/4m00.0s

running (0m57.0s), 047/150 VUs, 418 complete and 0 interrupted iterations
default   [  24% ] 047/150 VUs  0m57.0s/4m00.0s

running (0m58.0s), 048/150 VUs, 432 complete and 0 interrupted iterations
default   [  24% ] 048/150 VUs  0m58.0s/4m00.0s

running (0m59.0s), 049/150 VUs, 451 complete and 0 interrupted iterations
default   [  25% ] 049/150 VUs  0m59.0s/4m00.0s

running (1m00.0s), 049/150 VUs, 461 complete and 0 interrupted iterations
default   [  25% ] 049/150 VUs  1m00.0s/4m00.0s

running (1m01.0s), 050/150 VUs, 480 complete and 0 interrupted iterations
default   [  25% ] 050/150 VUs  1m01.0s/4m00.0s

running (1m02.0s), 051/150 VUs, 500 complete and 0 interrupted iterations
default   [  26% ] 051/150 VUs  1m02.0s/4m00.0s

running (1m03.0s), 052/150 VUs, 510 complete and 0 interrupted iterations
default   [  26% ] 052/150 VUs  1m03.0s/4m00.0s

running (1m04.0s), 053/150 VUs, 530 complete and 0 interrupted iterations
default   [  27% ] 053/150 VUs  1m04.0s/4m00.0s

running (1m05.0s), 054/150 VUs, 543 complete and 0 interrupted iterations
default   [  27% ] 054/150 VUs  1m05.0s/4m00.0s

running (1m06.0s), 054/150 VUs, 562 complete and 0 interrupted iterations
default   [  27% ] 054/150 VUs  1m06.0s/4m00.0s

running (1m07.0s), 055/150 VUs, 583 complete and 0 interrupted iterations
default   [  28% ] 055/150 VUs  1m07.0s/4m00.0s

running (1m08.0s), 056/150 VUs, 597 complete and 0 interrupted iterations
default   [  28% ] 056/150 VUs  1m08.0s/4m00.0s

running (1m09.0s), 057/150 VUs, 616 complete and 0 interrupted iterations
default   [  29% ] 057/150 VUs  1m09.0s/4m00.0s

running (1m10.0s), 058/150 VUs, 638 complete and 0 interrupted iterations
default   [  29% ] 058/150 VUs  1m10.0s/4m00.0s

running (1m11.0s), 059/150 VUs, 652 complete and 0 interrupted iterations
default   [  30% ] 059/150 VUs  1m11.0s/4m00.0s

running (1m12.0s), 059/150 VUs, 673 complete and 0 interrupted iterations
default   [  30% ] 059/150 VUs  1m12.0s/4m00.0s

running (1m13.0s), 060/150 VUs, 696 complete and 0 interrupted iterations
default   [  30% ] 060/150 VUs  1m13.0s/4m00.0s

running (1m14.0s), 061/150 VUs, 710 complete and 0 interrupted iterations
default   [  31% ] 061/150 VUs  1m14.0s/4m00.0s

running (1m15.0s), 062/150 VUs, 732 complete and 0 interrupted iterations
default   [  31% ] 062/150 VUs  1m15.0s/4m00.0s

running (1m16.0s), 063/150 VUs, 756 complete and 0 interrupted iterations
default   [  32% ] 063/150 VUs  1m16.0s/4m00.0s

running (1m17.0s), 064/150 VUs, 769 complete and 0 interrupted iterations
default   [  32% ] 064/150 VUs  1m17.0s/4m00.0s

running (1m18.0s), 064/150 VUs, 794 complete and 0 interrupted iterations
default   [  32% ] 064/150 VUs  1m18.0s/4m00.0s

running (1m19.0s), 065/150 VUs, 815 complete and 0 interrupted iterations
default   [  33% ] 065/150 VUs  1m19.0s/4m00.0s

running (1m20.0s), 066/150 VUs, 833 complete and 0 interrupted iterations
default   [  33% ] 066/150 VUs  1m20.0s/4m00.0s

running (1m21.0s), 067/150 VUs, 858 complete and 0 interrupted iterations
default   [  34% ] 067/150 VUs  1m21.0s/4m00.0s

running (1m22.0s), 068/150 VUs, 877 complete and 0 interrupted iterations
default   [  34% ] 068/150 VUs  1m22.0s/4m00.0s

running (1m23.0s), 069/150 VUs, 899 complete and 0 interrupted iterations
default   [  35% ] 069/150 VUs  1m23.0s/4m00.0s

running (1m24.0s), 069/150 VUs, 925 complete and 0 interrupted iterations
default   [  35% ] 069/150 VUs  1m24.0s/4m00.0s

running (1m25.0s), 070/150 VUs, 942 complete and 0 interrupted iterations
default   [  35% ] 070/150 VUs  1m25.0s/4m00.0s

running (1m26.0s), 071/150 VUs, 968 complete and 0 interrupted iterations
default   [  36% ] 071/150 VUs  1m26.0s/4m00.0s

running (1m27.0s), 072/150 VUs, 989 complete and 0 interrupted iterations
default   [  36% ] 072/150 VUs  1m27.0s/4m00.0s

running (1m28.0s), 073/150 VUs, 1011 complete and 0 interrupted iterations
default   [  37% ] 073/150 VUs  1m28.0s/4m00.0s

running (1m29.0s), 074/150 VUs, 1037 complete and 0 interrupted iterations
default   [  37% ] 074/150 VUs  1m29.0s/4m00.0s

running (1m30.0s), 074/150 VUs, 1057 complete and 0 interrupted iterations
default   [  37% ] 074/150 VUs  1m30.0s/4m00.0s

running (1m31.0s), 075/150 VUs, 1084 complete and 0 interrupted iterations
default   [  38% ] 075/150 VUs  1m31.0s/4m00.0s

running (1m32.0s), 076/150 VUs, 1104 complete and 0 interrupted iterations
default   [  38% ] 076/150 VUs  1m32.0s/4m00.0s

running (1m33.0s), 077/150 VUs, 1130 complete and 0 interrupted iterations
default   [  39% ] 077/150 VUs  1m33.0s/4m00.0s

running (1m34.0s), 078/150 VUs, 1158 complete and 0 interrupted iterations
default   [  39% ] 078/150 VUs  1m34.0s/4m00.0s

running (1m35.0s), 079/150 VUs, 1178 complete and 0 interrupted iterations
default   [  40% ] 079/150 VUs  1m35.0s/4m00.0s

running (1m36.0s), 079/150 VUs, 1207 complete and 0 interrupted iterations
default   [  40% ] 079/150 VUs  1m36.0s/4m00.0s

running (1m37.0s), 080/150 VUs, 1232 complete and 0 interrupted iterations
default   [  40% ] 080/150 VUs  1m37.0s/4m00.0s

running (1m38.0s), 081/150 VUs, 1256 complete and 0 interrupted iterations
default   [  41% ] 081/150 VUs  1m38.0s/4m00.0s

running (1m39.0s), 082/150 VUs, 1285 complete and 0 interrupted iterations
default   [  41% ] 082/150 VUs  1m39.0s/4m00.0s

running (1m40.0s), 083/150 VUs, 1306 complete and 0 interrupted iterations
default   [  42% ] 083/150 VUs  1m40.0s/4m00.0s

running (1m41.0s), 084/150 VUs, 1336 complete and 0 interrupted iterations
default   [  42% ] 084/150 VUs  1m41.0s/4m00.0s

running (1m42.0s), 084/150 VUs, 1367 complete and 0 interrupted iterations
default   [  42% ] 084/150 VUs  1m42.0s/4m00.0s

running (1m43.0s), 085/150 VUs, 1387 complete and 0 interrupted iterations
default   [  43% ] 085/150 VUs  1m43.0s/4m00.0s

running (1m44.0s), 086/150 VUs, 1419 complete and 0 interrupted iterations
default   [  43% ] 086/150 VUs  1m44.0s/4m00.0s

running (1m45.0s), 087/150 VUs, 1448 complete and 0 interrupted iterations
default   [  44% ] 087/150 VUs  1m45.0s/4m00.0s

running (1m46.0s), 088/150 VUs, 1472 complete and 0 interrupted iterations
default   [  44% ] 088/150 VUs  1m46.0s/4m00.0s

running (1m47.0s), 089/150 VUs, 1505 complete and 0 interrupted iterations
default   [  45% ] 089/150 VUs  1m47.0s/4m00.0s

running (1m48.0s), 089/150 VUs, 1532 complete and 0 interrupted iterations
default   [  45% ] 089/150 VUs  1m48.0s/4m00.0s

running (1m49.0s), 090/150 VUs, 1560 complete and 0 interrupted iterations
default   [  45% ] 090/150 VUs  1m49.0s/4m00.0s

running (1m50.0s), 091/150 VUs, 1593 complete and 0 interrupted iterations
default   [  46% ] 091/150 VUs  1m50.0s/4m00.0s

running (1m51.0s), 092/150 VUs, 1620 complete and 0 interrupted iterations
default   [  46% ] 092/150 VUs  1m51.0s/4m00.0s

running (1m52.0s), 093/150 VUs, 1649 complete and 0 interrupted iterations
default   [  47% ] 093/150 VUs  1m52.0s/4m00.0s

running (1m53.0s), 094/150 VUs, 1681 complete and 0 interrupted iterations
default   [  47% ] 094/150 VUs  1m53.0s/4m00.0s

running (1m54.0s), 094/150 VUs, 1707 complete and 0 interrupted iterations
default   [  47% ] 094/150 VUs  1m54.0s/4m00.0s

running (1m55.0s), 095/150 VUs, 1742 complete and 0 interrupted iterations
default   [  48% ] 095/150 VUs  1m55.0s/4m00.0s

running (1m56.0s), 096/150 VUs, 1768 complete and 0 interrupted iterations
default   [  48% ] 096/150 VUs  1m56.0s/4m00.0s

running (1m57.0s), 097/150 VUs, 1801 complete and 0 interrupted iterations
default   [  49% ] 097/150 VUs  1m57.0s/4m00.0s

running (1m58.0s), 098/150 VUs, 1835 complete and 0 interrupted iterations
default   [  49% ] 098/150 VUs  1m58.0s/4m00.0s

running (1m59.0s), 099/150 VUs, 1863 complete and 0 interrupted iterations
default   [  50% ] 099/150 VUs  1m59.0s/4m00.0s

running (2m00.0s), 099/150 VUs, 1897 complete and 0 interrupted iterations
default   [  50% ] 099/150 VUs  2m00.0s/4m00.0s

running (2m01.0s), 100/150 VUs, 1930 complete and 0 interrupted iterations
default   [  50% ] 100/150 VUs  2m01.0s/4m00.0s

running (2m02.0s), 101/150 VUs, 1962 complete and 0 interrupted iterations
default   [  51% ] 101/150 VUs  2m02.0s/4m00.0s

running (2m03.0s), 102/150 VUs, 1994 complete and 0 interrupted iterations
default   [  51% ] 102/150 VUs  2m03.0s/4m00.0s

running (2m04.0s), 103/150 VUs, 2024 complete and 0 interrupted iterations
default   [  52% ] 103/150 VUs  2m04.0s/4m00.0s

running (2m05.0s), 104/150 VUs, 2060 complete and 0 interrupted iterations
default   [  52% ] 104/150 VUs  2m05.0s/4m00.0s

running (2m06.0s), 104/150 VUs, 2090 complete and 0 interrupted iterations
default   [  52% ] 104/150 VUs  2m06.0s/4m00.0s

running (2m07.0s), 105/150 VUs, 2127 complete and 0 interrupted iterations
default   [  53% ] 105/150 VUs  2m07.0s/4m00.0s

running (2m08.0s), 106/150 VUs, 2161 complete and 0 interrupted iterations
default   [  53% ] 106/150 VUs  2m08.0s/4m00.0s

running (2m09.0s), 107/150 VUs, 2194 complete and 0 interrupted iterations
default   [  54% ] 107/150 VUs  2m09.0s/4m00.0s

running (2m10.0s), 108/150 VUs, 2230 complete and 0 interrupted iterations
default   [  54% ] 108/150 VUs  2m10.0s/4m00.0s

running (2m11.0s), 109/150 VUs, 2267 complete and 0 interrupted iterations
default   [  55% ] 109/150 VUs  2m11.0s/4m00.0s

running (2m12.0s), 109/150 VUs, 2297 complete and 0 interrupted iterations
default   [  55% ] 109/150 VUs  2m12.0s/4m00.0s

running (2m13.0s), 110/150 VUs, 2336 complete and 0 interrupted iterations
default   [  55% ] 110/150 VUs  2m13.0s/4m00.0s

running (2m14.0s), 111/150 VUs, 2368 complete and 0 interrupted iterations
default   [  56% ] 111/150 VUs  2m14.0s/4m00.0s

running (2m15.0s), 112/150 VUs, 2405 complete and 0 interrupted iterations
default   [  56% ] 112/150 VUs  2m15.0s/4m00.0s

running (2m16.0s), 113/150 VUs, 2446 complete and 0 interrupted iterations
default   [  57% ] 113/150 VUs  2m16.0s/4m00.0s

running (2m17.0s), 114/150 VUs, 2471 complete and 0 interrupted iterations
default   [  57% ] 114/150 VUs  2m17.0s/4m00.0s

running (2m18.0s), 114/150 VUs, 2516 complete and 0 interrupted iterations
default   [  57% ] 114/150 VUs  2m18.0s/4m00.0s

running (2m19.0s), 115/150 VUs, 2552 complete and 0 interrupted iterations
default   [  58% ] 115/150 VUs  2m19.0s/4m00.0s

running (2m20.0s), 116/150 VUs, 2584 complete and 0 interrupted iterations
default   [  58% ] 116/150 VUs  2m20.0s/4m00.0s

running (2m21.0s), 117/150 VUs, 2626 complete and 0 interrupted iterations
default   [  59% ] 117/150 VUs  2m21.0s/4m00.0s

running (2m22.0s), 118/150 VUs, 2656 complete and 0 interrupted iterations
default   [  59% ] 118/150 VUs  2m22.0s/4m00.0s

running (2m23.0s), 119/150 VUs, 2699 complete and 0 interrupted iterations
default   [  60% ] 119/150 VUs  2m23.0s/4m00.0s

running (2m24.0s), 119/150 VUs, 2741 complete and 0 interrupted iterations
default   [  60% ] 119/150 VUs  2m24.0s/4m00.0s

running (2m25.0s), 120/150 VUs, 2772 complete and 0 interrupted iterations
default   [  60% ] 120/150 VUs  2m25.0s/4m00.0s

running (2m26.0s), 121/150 VUs, 2818 complete and 0 interrupted iterations
default   [  61% ] 121/150 VUs  2m26.0s/4m00.0s

running (2m27.0s), 122/150 VUs, 2854 complete and 0 interrupted iterations
default   [  61% ] 122/150 VUs  2m27.0s/4m00.0s

running (2m28.0s), 123/150 VUs, 2891 complete and 0 interrupted iterations
default   [  62% ] 123/150 VUs  2m28.0s/4m00.0s

running (2m29.0s), 124/150 VUs, 2938 complete and 0 interrupted iterations
default   [  62% ] 124/150 VUs  2m29.0s/4m00.0s

running (2m30.0s), 124/150 VUs, 2972 complete and 0 interrupted iterations
default   [  62% ] 124/150 VUs  2m30.0s/4m00.0s

running (2m31.0s), 125/150 VUs, 3013 complete and 0 interrupted iterations
default   [  63% ] 125/150 VUs  2m31.0s/4m00.0s

running (2m32.0s), 126/150 VUs, 3053 complete and 0 interrupted iterations
default   [  63% ] 126/150 VUs  2m32.0s/4m00.0s

running (2m33.0s), 127/150 VUs, 3089 complete and 0 interrupted iterations
default   [  64% ] 127/150 VUs  2m33.0s/4m00.0s

running (2m34.0s), 128/150 VUs, 3129 complete and 0 interrupted iterations
default   [  64% ] 128/150 VUs  2m34.0s/4m00.0s

running (2m35.0s), 129/150 VUs, 3178 complete and 0 interrupted iterations
default   [  65% ] 129/150 VUs  2m35.0s/4m00.0s

running (2m36.0s), 129/150 VUs, 3207 complete and 0 interrupted iterations
default   [  65% ] 129/150 VUs  2m36.0s/4m00.0s

running (2m37.0s), 130/150 VUs, 3257 complete and 0 interrupted iterations
default   [  65% ] 130/150 VUs  2m37.0s/4m00.0s

running (2m38.0s), 131/150 VUs, 3305 complete and 0 interrupted iterations
default   [  66% ] 131/150 VUs  2m38.0s/4m00.0s

running (2m39.0s), 132/150 VUs, 3332 complete and 0 interrupted iterations
default   [  66% ] 132/150 VUs  2m39.0s/4m00.0s

running (2m40.0s), 133/150 VUs, 3387 complete and 0 interrupted iterations
default   [  67% ] 133/150 VUs  2m40.0s/4m00.0s

running (2m41.0s), 134/150 VUs, 3408 complete and 0 interrupted iterations
default   [  67% ] 134/150 VUs  2m41.0s/4m00.0s

running (2m42.0s), 134/150 VUs, 3457 complete and 0 interrupted iterations
default   [  67% ] 134/150 VUs  2m42.0s/4m00.0s

running (2m43.0s), 135/150 VUs, 3518 complete and 0 interrupted iterations
default   [  68% ] 135/150 VUs  2m43.0s/4m00.0s

running (2m44.0s), 136/150 VUs, 3541 complete and 0 interrupted iterations
default   [  68% ] 136/150 VUs  2m44.0s/4m00.0s

running (2m45.0s), 137/150 VUs, 3590 complete and 0 interrupted iterations
default   [  69% ] 137/150 VUs  2m45.0s/4m00.0s

running (2m46.0s), 138/150 VUs, 3643 complete and 0 interrupted iterations
default   [  69% ] 138/150 VUs  2m46.0s/4m00.0s

running (2m47.0s), 139/150 VUs, 3671 complete and 0 interrupted iterations
default   [  70% ] 139/150 VUs  2m47.0s/4m00.0s

running (2m48.0s), 139/150 VUs, 3727 complete and 0 interrupted iterations
default   [  70% ] 139/150 VUs  2m48.0s/4m00.0s

running (2m49.0s), 140/150 VUs, 3763 complete and 0 interrupted iterations
default   [  70% ] 140/150 VUs  2m49.0s/4m00.0s

running (2m50.0s), 141/150 VUs, 3809 complete and 0 interrupted iterations
default   [  71% ] 141/150 VUs  2m50.0s/4m00.0s

running (2m51.0s), 142/150 VUs, 3843 complete and 0 interrupted iterations
default   [  71% ] 142/150 VUs  2m51.0s/4m00.0s

running (2m52.0s), 143/150 VUs, 3899 complete and 0 interrupted iterations
default   [  72% ] 143/150 VUs  2m52.0s/4m00.0s

running (2m53.0s), 144/150 VUs, 3947 complete and 0 interrupted iterations
default   [  72% ] 144/150 VUs  2m53.0s/4m00.0s

running (2m54.0s), 144/150 VUs, 3985 complete and 0 interrupted iterations
default   [  72% ] 144/150 VUs  2m54.0s/4m00.0s

running (2m55.0s), 145/150 VUs, 4042 complete and 0 interrupted iterations
default   [  73% ] 145/150 VUs  2m55.0s/4m00.0s

running (2m56.0s), 146/150 VUs, 4070 complete and 0 interrupted iterations
default   [  73% ] 146/150 VUs  2m56.0s/4m00.0s

running (2m57.0s), 147/150 VUs, 4126 complete and 0 interrupted iterations
default   [  74% ] 147/150 VUs  2m57.0s/4m00.0s

running (2m58.0s), 148/150 VUs, 4181 complete and 0 interrupted iterations
default   [  74% ] 148/150 VUs  2m58.0s/4m00.0s

running (2m59.0s), 149/150 VUs, 4211 complete and 0 interrupted iterations
default   [  75% ] 149/150 VUs  2m59.0s/4m00.0s

running (3m00.0s), 149/150 VUs, 4270 complete and 0 interrupted iterations
default   [  75% ] 149/150 VUs  3m00.0s/4m00.0s

running (3m01.0s), 150/150 VUs, 4298 complete and 0 interrupted iterations
default   [  75% ] 150/150 VUs  3m01.0s/4m00.0s

running (3m02.0s), 149/150 VUs, 4358 complete and 0 interrupted iterations
default   [  76% ] 149/150 VUs  3m02.0s/4m00.0s

running (3m03.0s), 148/150 VUs, 4412 complete and 0 interrupted iterations
default   [  76% ] 148/150 VUs  3m03.0s/4m00.0s

running (3m04.0s), 146/150 VUs, 4444 complete and 0 interrupted iterations
default   [  77% ] 146/150 VUs  3m04.0s/4m00.0s

running (3m05.0s), 143/150 VUs, 4504 complete and 0 interrupted iterations
default   [  77% ] 143/150 VUs  3m05.0s/4m00.0s

running (3m06.0s), 140/150 VUs, 4538 complete and 0 interrupted iterations
default   [  77% ] 140/150 VUs  3m06.0s/4m00.0s

running (3m07.0s), 138/150 VUs, 4589 complete and 0 interrupted iterations
default   [  78% ] 138/150 VUs  3m07.0s/4m00.0s

running (3m08.0s), 135/150 VUs, 4634 complete and 0 interrupted iterations
default   [  78% ] 135/150 VUs  3m08.0s/4m00.0s

running (3m09.0s), 132/150 VUs, 4677 complete and 0 interrupted iterations
default   [  79% ] 132/150 VUs  3m09.0s/4m00.0s

running (3m10.0s), 130/150 VUs, 4726 complete and 0 interrupted iterations
default   [  79% ] 130/150 VUs  3m10.0s/4m00.0s

running (3m11.0s), 128/150 VUs, 4759 complete and 0 interrupted iterations
default   [  80% ] 128/150 VUs  3m11.0s/4m00.0s

running (3m12.0s), 127/150 VUs, 4806 complete and 0 interrupted iterations
default   [  80% ] 127/150 VUs  3m12.0s/4m00.0s

running (3m13.0s), 125/150 VUs, 4854 complete and 0 interrupted iterations
default   [  80% ] 125/150 VUs  3m13.0s/4m00.0s

running (3m14.0s), 123/150 VUs, 4880 complete and 0 interrupted iterations
default   [  81% ] 123/150 VUs  3m14.0s/4m00.0s

running (3m15.0s), 119/150 VUs, 4933 complete and 0 interrupted iterations
default   [  81% ] 119/150 VUs  3m15.0s/4m00.0s

running (3m16.0s), 116/150 VUs, 4979 complete and 0 interrupted iterations
default   [  82% ] 116/150 VUs  3m16.0s/4m00.0s

running (3m17.0s), 115/150 VUs, 5002 complete and 0 interrupted iterations
default   [  82% ] 115/150 VUs  3m17.0s/4m00.0s

running (3m18.0s), 111/150 VUs, 5052 complete and 0 interrupted iterations
default   [  82% ] 111/150 VUs  3m18.0s/4m00.0s

running (3m19.0s), 109/150 VUs, 5092 complete and 0 interrupted iterations
default   [  83% ] 109/150 VUs  3m19.0s/4m00.0s

running (3m20.0s), 108/150 VUs, 5113 complete and 0 interrupted iterations
default   [  83% ] 108/150 VUs  3m20.0s/4m00.0s

running (3m21.0s), 106/150 VUs, 5158 complete and 0 interrupted iterations
default   [  84% ] 106/150 VUs  3m21.0s/4m00.0s

running (3m22.0s), 104/150 VUs, 5193 complete and 0 interrupted iterations
default   [  84% ] 104/150 VUs  3m22.0s/4m00.0s

running (3m23.0s), 102/150 VUs, 5219 complete and 0 interrupted iterations
default   [  85% ] 102/150 VUs  3m23.0s/4m00.0s

running (3m24.0s), 098/150 VUs, 5255 complete and 0 interrupted iterations
default   [  85% ] 098/150 VUs  3m24.0s/4m00.0s

running (3m25.0s), 095/150 VUs, 5293 complete and 0 interrupted iterations
default   [  85% ] 095/150 VUs  3m25.0s/4m00.0s

running (3m26.0s), 093/150 VUs, 5321 complete and 0 interrupted iterations
default   [  86% ] 093/150 VUs  3m26.0s/4m00.0s

running (3m27.0s), 090/150 VUs, 5353 complete and 0 interrupted iterations
default   [  86% ] 090/150 VUs  3m27.0s/4m00.0s

running (3m28.0s), 088/150 VUs, 5387 complete and 0 interrupted iterations
default   [  87% ] 088/150 VUs  3m28.0s/4m00.0s

running (3m29.0s), 086/150 VUs, 5412 complete and 0 interrupted iterations
default   [  87% ] 086/150 VUs  3m29.0s/4m00.0s

running (3m30.0s), 085/150 VUs, 5443 complete and 0 interrupted iterations
default   [  87% ] 085/150 VUs  3m30.0s/4m00.0s

running (3m31.0s), 081/150 VUs, 5473 complete and 0 interrupted iterations
default   [  88% ] 081/150 VUs  3m31.0s/4m00.0s

running (3m32.0s), 079/150 VUs, 5498 complete and 0 interrupted iterations
default   [  88% ] 079/150 VUs  3m32.0s/4m00.0s

running (3m33.0s), 076/150 VUs, 5525 complete and 0 interrupted iterations
default   [  89% ] 076/150 VUs  3m33.0s/4m00.0s

running (3m34.0s), 074/150 VUs, 5552 complete and 0 interrupted iterations
default   [  89% ] 074/150 VUs  3m34.0s/4m00.0s

running (3m35.0s), 073/150 VUs, 5576 complete and 0 interrupted iterations
default   [  90% ] 073/150 VUs  3m35.0s/4m00.0s

running (3m36.0s), 071/150 VUs, 5599 complete and 0 interrupted iterations
default   [  90% ] 071/150 VUs  3m36.0s/4m00.0s

running (3m37.0s), 068/150 VUs, 5626 complete and 0 interrupted iterations
default   [  90% ] 068/150 VUs  3m37.0s/4m00.0s

running (3m38.0s), 064/150 VUs, 5649 complete and 0 interrupted iterations
default   [  91% ] 064/150 VUs  3m38.0s/4m00.0s

running (3m39.0s), 062/150 VUs, 5667 complete and 0 interrupted iterations
default   [  91% ] 062/150 VUs  3m39.0s/4m00.0s

running (3m40.0s), 060/150 VUs, 5694 complete and 0 interrupted iterations
default   [  92% ] 060/150 VUs  3m40.0s/4m00.0s

running (3m41.0s), 059/150 VUs, 5709 complete and 0 interrupted iterations
default   [  92% ] 059/150 VUs  3m41.0s/4m00.0s

running (3m42.0s), 057/150 VUs, 5727 complete and 0 interrupted iterations
default   [  92% ] 057/150 VUs  3m42.0s/4m00.0s

running (3m43.0s), 054/150 VUs, 5752 complete and 0 interrupted iterations
default   [  93% ] 054/150 VUs  3m43.0s/4m00.0s

running (3m44.0s), 051/150 VUs, 5766 complete and 0 interrupted iterations
default   [  93% ] 051/150 VUs  3m44.0s/4m00.0s

running (3m45.0s), 049/150 VUs, 5784 complete and 0 interrupted iterations
default   [  94% ] 049/150 VUs  3m45.0s/4m00.0s

running (3m46.0s), 046/150 VUs, 5804 complete and 0 interrupted iterations
default   [  94% ] 046/150 VUs  3m46.0s/4m00.0s

running (3m47.0s), 045/150 VUs, 5817 complete and 0 interrupted iterations
default   [  95% ] 045/150 VUs  3m47.0s/4m00.0s

running (3m48.0s), 043/150 VUs, 5831 complete and 0 interrupted iterations
default   [  95% ] 043/150 VUs  3m48.0s/4m00.0s

running (3m49.0s), 040/150 VUs, 5850 complete and 0 interrupted iterations
default   [  95% ] 040/150 VUs  3m49.0s/4m00.0s

running (3m50.0s), 036/150 VUs, 5862 complete and 0 interrupted iterations
default   [  96% ] 036/150 VUs  3m50.0s/4m00.0s

running (3m51.0s), 036/150 VUs, 5873 complete and 0 interrupted iterations
default   [  96% ] 036/150 VUs  3m51.0s/4m00.0s

running (3m52.0s), 032/150 VUs, 5890 complete and 0 interrupted iterations
default   [  97% ] 032/150 VUs  3m52.0s/4m00.0s

running (3m53.0s), 031/150 VUs, 5898 complete and 0 interrupted iterations
default   [  97% ] 031/150 VUs  3m53.0s/4m00.0s

running (3m54.0s), 029/150 VUs, 5909 complete and 0 interrupted iterations
default   [  97% ] 029/150 VUs  3m54.0s/4m00.0s

running (3m55.0s), 026/150 VUs, 5922 complete and 0 interrupted iterations
default   [  98% ] 026/150 VUs  3m55.0s/4m00.0s

running (3m56.0s), 023/150 VUs, 5929 complete and 0 interrupted iterations
default   [  98% ] 023/150 VUs  3m56.0s/4m00.0s

running (3m57.0s), 021/150 VUs, 5938 complete and 0 interrupted iterations
default   [  99% ] 021/150 VUs  3m57.0s/4m00.0s

running (3m58.0s), 018/150 VUs, 5948 complete and 0 interrupted iterations
default   [  99% ] 018/150 VUs  3m58.0s/4m00.0s

running (3m59.0s), 017/150 VUs, 5952 complete and 0 interrupted iterations
default   [ 100% ] 017/150 VUs  3m59.0s/4m00.0s

running (4m00.0s), 014/150 VUs, 5959 complete and 0 interrupted iterations
default   [ 100% ] 014/150 VUs  4m00.0s/4m00.0s

running (4m01.0s), 007/150 VUs, 5966 complete and 0 interrupted iterations
default ↓ [ 100% ] 014/150 VUs  4m0s

running (4m02.0s), 004/150 VUs, 5969 complete and 0 interrupted iterations
default ↓ [ 100% ] 014/150 VUs  4m0s

     ✓ POST /API/users - Status 200
     ✓ GET /API/users - Status 200
     ✓ GET /API/users/email - Status 200
     ✓ POST /API/users/1 - Status 200
     ✓ DELETE /API/users/delete - Status 200

     checks.........................: 100.00% 29865 out of 29865
     data_received..................: 116 MB  477 kB/s
     data_sent......................: 7.8 MB  32 kB/s
     http_req_blocked...............: avg=29.83µs min=954ns  med=5.77µs   max=65.66ms  p(90)=10.61µs p(95)=13.6µs 
     http_req_connecting............: avg=21.87µs min=0s     med=0s       max=65.54ms  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=18.86ms min=1.79ms med=13.01ms  max=318.14ms p(90)=38.87ms p(95)=56.23ms
       { expected_response:true }...: avg=18.86ms min=1.79ms med=13.01ms  max=318.14ms p(90)=38.87ms p(95)=56.23ms
     http_req_failed................: 0.00%   0 out of 29865
     http_req_receiving.............: avg=1.6ms   min=7.59µs med=521.04µs max=70.48ms  p(90)=3.89ms  p(95)=6.82ms 
     http_req_sending...............: avg=33.16µs min=3.09µs med=20.89µs  max=6.85ms   p(90)=70.78µs p(95)=90.05µs
     http_req_tls_handshaking.......: avg=0s      min=0s     med=0s       max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=17.22ms min=1.53ms med=11.92ms  max=273.84ms p(90)=36.21ms p(95)=51.28ms
     http_reqs......................: 29865   123.10319/s
     iteration_duration.............: avg=3.09s   min=3.03s  med=3.07s    max=3.67s    p(90)=3.17s   p(95)=3.24s  
     iterations.....................: 5973    24.620638/s
     vus............................: 4       min=1              max=150
     vus_max........................: 150     min=150            max=150


running (4m02.6s), 000/150 VUs, 5973 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/150 VUs  4m0s